app/controllers/life_events_controller.rb

INSERT INTO "life_events" ("created_at", "day", "description", "happiness", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @life_event = LifeEvent.new(life_event_params)
    @life_event.user = current_user

    @life_event.save

SELECT  "life_events".* FROM "life_events" WHERE "life_events"."id" = ? LIMIT 1
---
    def set_life_event
      @life_event = LifeEvent.find(params[:id])